export interface Prefecture {
  name: string;
  cities: string[];
}

export const prefectures: Prefecture[] = [
  {
    name: "ほし都",
    cities: [
      "すいせい市",
      "ほしぞら市",
      "ぎんが町",
      "つきのわ市",
      "たいよう町",
      "しんせい市",
      "ほきょう町",
      "せいざ市",
      "ながれぼし町",
      "きらぼし村",
    ],
  },
  {
    name: "おんがく県",
    cities: [
      "バイオリン市",
      "ピアノ町",
      "フルート市",
      "ドラム町",
      "ギター市",
      "サックス町",
      "クラリネット市",
      "トランペット町",
      "オルガン市",
      "ハープ村",
    ],
  },
  {
    name: "みず府",
    cities: [
      "かわ市",
      "みなと市",
      "いけ町",
      "うみ市",
      "おおがわ町",
      "しおさい市",
      "なみ市",
      "しずく町",
      "みずうみ市",
      "たき村",
    ],
  },
  {
    name: "いし県",
    cities: [
      "ダイヤ市",
      "ルビー町",
      "サファイア市",
      "エメラルド町",
      "オパール市",
      "トパーズ町",
      "アメジスト市",
      "ガーネット町",
      "ターコイズ市",
      "ジェード村",
    ],
  },
  {
    name: "そら県",
    cities: [
      "あおぞら市",
      "くも市",
      "にじ町",
      "かぜ市",
      "ひかり町",
      "そよかぜ市",
      "おおぞら町",
      "ゆき市",
      "あらし町",
      "はれまち村",
    ],
  },
];

export function findPrefecture(name: string) {
  return prefectures.find((p) => p.name === name);
}
